#include <iostream>

using namespace std;

int main()
{
    //1.05 = 12*105коп = 1260
    //9*105 = 945
    //1*1025 = 1025
    //12*1025 = 12300
    //кор = 11400
    int n, ost, n1 = 0, n2 = 0, n3 = 0;
    int price1 = 11400, price2 = 1025, price3 = 105;
    cin >> n;
    n1 = n/144; //12 связок по 12 носков
    n2 = n%144/12;  //связки
    n3 = n%12; // единицы
    if(n3 > 9){
        n3 = 0;
        n2+=1;
    }
    if((n3*105)+(n2*1025) > 11400){
        n1+=1;
        n2=0;
        n3=0;
    }
   cout << n1 << " " << n2 << " " << n3;
   return 0;
}
